# zadanie 5
import random

repcount = 1
while repcount > 0:

    num = random.randint(1, 10)
    print(f'\nБыло выбрано случайное число от 1 до 10:')
    print('у тебя 3 попытки угадать')
    # print(num)
    count = 0

    while count != 3:

        x = int(input('какое число было загадано? '))
        if x != num:
            count += 1
            print(f'{"*"*31}\n{"*"}{" "*9}не то число{" "*9}{"*"}\n{"*"}  у тебя осталось {3-count} попытки  {"*"}\n{"*"*31}')
            if count == 3:
                print(''' $$$$    $$$$   $$   $$ $$$$$       $$$$   $$  $$  $$$$$   $$$$$
$$      $$  $$  $$$ $$$ $$         $$  $$  $$  $$  $$      $$  $$
$$ $$$  $$$$$$  $$ $ $$ $$$$       $$  $$  $$  $$  $$$$    $$$$$
$$  $$  $$  $$  $$   $$ $$         $$  $$   $$$$   $$      $$  $$
 $$$$   $$  $$  $$   $$ $$$$$       $$$$     $$    $$$$$   $$  $$''')
        else:
            print('''00  00    0000   00  00     00   00 000000 00  00
 0000    00  00  00  00     00   00   00   000 00
  00     00  00  00  00     00 0 00   00   00 000
  00     00  00  00  00     0000000   00   00  00
  00      0000    0000       00 00  000000 00  00''')

            break
    repcount += 1
    print(f'\nнажми Enter чтобы сыграть еще раз\n')
    input()
